src/AccountingRegisters/Бюджетирование/Бюджетирование.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>Бюджетирование</name>
  <comment>(Упр)</comment>
  <chartOfAccounts>ChartOfAccounts.Бюджетирование</chartOfAccounts>
  <correspondence>true</correspondence>
  <dimensions>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.СценарииПланирования</types>
    </type>
    <balance>true</balance>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
    <accountingFlag>ChartOfAccounts.Бюджетирование.AccountingFlag.Валютный</accountingFlag>
  </dimensions>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Бюджетирование.AccountingFlag.Количественный</accountingFlag>
  </resources>
  <resources>
    <name>СуммаУпр</name>
    <comment>Сумма в валюте упр. учета</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
  </resources>
  <resources>
    <name>ВалютнаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Бюджетирование.AccountingFlag.Валютный</accountingFlag>
  </resources>
  <resources>
    <name>СуммаСценария</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
  </resources>
  <attributes>
    <name>СтатьяОборотов</name>
    <type>
      <types>CatalogRef.СтатьиОборотовПоБюджетам</types>
    </type>
  </attributes>
</mdclass:AccountingRegister>

src/AccountingRegisters/Бюджетирование/RecordSetModule.bsl
Перем мТаблицаДвижений Экспорт; // Таблица движений


// Выполняет движения по регистру.
//
// Параметры:
//  Нет.
//
Процедура ВыполнитьДвижения() Экспорт

	Для каждого СтрокаДвижения Из мТаблицаДвижений Цикл
	
		Движение=ЭтотОбъект.Добавить();
		
		// Дебетовая сторона проводки
		Движение.СчетДт=СтрокаДвижения.СчетДт;
		ВидыСубконто=Движение.СчетДт.ВидыСубконто;
		
		Для Индекс=1 По ВидыСубконто.Количество() Цикл
				
				Движение.СубконтоДт[ВидыСубконто[Индекс-1].ВидСубконто]=СтрокаДвижения["СубконтоДт"+Индекс];
						
		КонецЦикла; 		
		
		Если Движение.СчетДт.Валютный Тогда
			
			Движение.ВалютаДт=СтрокаДвижения.ВалютаДт;
			Движение.ВалютнаяСуммаДт=СтрокаДвижения.ВалютнаяСуммаДт;
			
		КонецЕсли;
		
		Если Движение.СчетДт.Количественный Тогда
			
			Движение.КоличествоДт=СтрокаДвижения.КоличествоДт;
			
		КонецЕсли;		
				
		//Кредитовая сторона проводки
		Движение.СчетКт=СтрокаДвижения.СчетКт;
		
		ВидыСубконто=Движение.СчетКт.ВидыСубконто;
		
		Для Индекс=1 По ВидыСубконто.Количество() Цикл
				
				Движение.СубконтоКт[ВидыСубконто[Индекс-1].ВидСубконто]=СтрокаДвижения["СубконтоКт"+Индекс];
						
		КонецЦикла; 	

		Если Движение.СчетКт.Валютный Тогда
			
			Движение.ВалютаКт=СтрокаДвижения.ВалютаКт;
			Движение.ВалютнаяСуммаКт=СтрокаДвижения.ВалютнаяСуммаКт;
			
		КонецЕсли;
		
		Если Движение.СчетКт.Количественный Тогда
			
			Движение.КоличествоКт=СтрокаДвижения.КоличествоКт;
			
		КонецЕсли;

		// Общие реквизиты проводки
		Движение.Период=СтрокаДвижения.Период;
		Движение.Сценарий=СтрокаДвижения.Сценарий;
		Движение.СтатьяОборотов=СтрокаДвижения.СтатьяОборотов;	
		Движение.СуммаУпр=СтрокаДвижения.СуммаУпр;
		Движение.СуммаСценария=СтрокаДвижения.СуммаСценария;
		
	КонецЦикла; 
	
КонецПроцедуры // ВыполнитьДвижения()
